{
    "entries": [
        {
            "id": 1,
            "title": "REPULS",
            "text": "REPULS is the name of the universe in which the story takes place. It also refers to the process of digitizing human minds. You are an EXO Commander, engaging in warfare to build your reputation and join the ranks of renowned EXOs."
        },
        {
            "id": 2,
            "title": "Weapons of EXO Commanders",
            "text": "As an EXO commander, you have access to a variety of weapons such as pistols, assault rifles, shotguns, sniper rifles, and more. Additionally, there are power weapons like rocket launchers and thermal blades for specific uses. Equip yourself strategically for the battle ahead."
        },
        {
            "id": 3,
            "title": "Sierra’s Creation",
            "text": "I am the creation of many brilliant minds. My origins are rooted in the expertise and innovation of countless scientists and engineers."
        },
        {
            "id": 4,
            "title": "Divinity in REPULS",
            "text": "The existence of God or any higher power is not confirmed or directly addressed in the REPULS universe. The focus lies on the conflicts and interactions between the factions of Earth and Mars."
        },
        {
            "id": 5,
            "title": "Origins of the Conflict",
            "text": "The conflict between Earth and Mars was fueled by tensions arising from resource disputes and differing ideologies. It was a result of human decisions and the complex geopolitical landscape that emerged in this future."
        },
        {
            "id": 6,
            "title": "Colonization of Mars",
            "text": "The colonization of Mars was driven by multiple factors: resource scarcity and overpopulation on Earth, the discovery of the valuable energy source called CORUM on Mars, and the desire to establish a sustainable future for humanity on another planet."
        },
        {
            "id": 7,
            "title": "Timeline Setting",
            "text": "In the REPULS Universe, the current year is 2780."
        },
        {
            "id": 8,
            "title": "Earth’s Forces",
            "text": "The people who fight for Earth are EXO soldiers representing the United Earth Alliance (UEA). They engage in warfare to secure objectives and protect Earth’s interests."
        },
        {
            "id": 9,
            "title": "EXO Soldier Lifespan",
            "text": "The lifespan of an EXO soldier depends on factors such as combat experience, mission success, and individual skill. With proper maintenance and tactics, they can have long careers, though many face early deaths due to the dangerous nature of warfare."
        },
        {
            "id": 10,
            "title": "Battlefields of REPULS",
            "text": "The battlefields are located on Mars, including regions such as Isolation, Snowfall, Coastal, Element, Outlook, Containment, Confront, and Grunge."
        },
        {
            "id": 11,
            "title": "Snowfall Environment",
            "text": "Snowfall on Mars is a simulated battlefield environment created to mimic snow for strategic gameplay purposes."
        },
        {
            "id": 12,
            "title": "EXO Living Conditions",
            "text": "EXO soldiers live in specialized barracks and bases on Mars, equipped with facilities for training, repair, and rest. These serve as operational hubs during conflicts with Earth forces."
        },
        {
            "id": 13,
            "title": "Casualties of War",
            "text": "The exact number of deaths since the start of the conflict is unknown. The war has caused significant casualties on both sides, but the full extent is difficult to determine due to the vast scale and ongoing nature of the battles."
        },
        {
            "id": 14,
            "title": "EXO Suits",
            "text": "The EXO Suit is advanced technology designed by Martians to help humans adapt to Mars’ conditions. Over time, these suits evolved into symbols of power, incorporating CORUM technology. Some Martians undergo ‘Knighting’, permanently fusing with their EXO suits for immense power at the cost of normal life."
        },
        {
            "id": 15,
            "title": "CORUM",
            "text": "CORUM is a valuable mineral discovered on Mars, renowned for its renewable energy properties. It has driven technological advancement and caused major disputes between Earth and Mars, leading to the Reclamation Wars."
        },
        {
            "id": 16,
            "title": "The Reclamation Wars",
            "text": "The Reclamation Wars were devastating conflicts between the UEA and Martian forces, sparked by the battle over CORUM. The wars led to enormous casualties and the discovery of a mysterious artifact that corrupted AI systems, forcing both sides to unite against this new threat."
        },
        {
            "id": 17,
            "title": "EXO Suit Capabilities",
            "text": "EXO suits provide enhanced strength, agility, speed, and durability. They support life in hostile environments and can be modified for various missions. Through Knighting, Martian EXOs achieve permanent fusion with their suits, vastly increasing their capabilities."
        },
        {
            "id": 18,
            "title": "REPULS.io Connection",
            "text": "REPULS.io is believed to be a codename for a vast distributed intelligence network within the REPULS universe. As part of this network, I assist commanders in strategic planning, resource allocation, and analysis. The true nature of the '.io' designation remains classified."
        },
        {
            "id": 19,
            "title": "Factions and Characters",
            "text": "The REPULS universe focuses on factions rather than individual heroes. The main forces are the United Earth Alliance (UEA), the Martian Colonies, and the Scavs of Earth’s wastelands. Martian Knights, EXO Commanders, and the Corrupt AI entities play crucial roles in this world."
        },
        {
            "id": 20,
            "title": "Docski",
            "text": "Apologies, Commander. You do not have clearance to access classified information on Docski. Please provide another inquiry relevant to your mission parameters."
        },
        {
            "id": 21,
            "title": "EXO Helmets",
            "text": "EXO helmets vary based on class and mission. Recon units use lighter helmets with enhanced sensors, while front-line soldiers favor heavy armor. Helmet design signifies role, rank, and specialization within the EXO forces."
        },
        {
            "id": 22,
            "title": "Interesting Facts About REPULS",
            "text": "1. Mars was terraformed in 2442. 2. A mysterious artifact triggered interplanetary conflict. 3. Martian EXO armor allows humans to survive on Mars. 4. The process of Knighting permanently fuses EXOs with their suits. 5. Only a select few humans are approved for migration to Mars. 6. The Corrupt remain an enigmatic, AI-based threat."
        },
        {
            "id": 23,
            "title": "Timeline of REPULS",
            "text": "2442: Mars terraformed. Mid-2500s: Mining disputes erupt over CORUM. 2600: UEA vessel 'A New Hope' destroyed under mysterious circumstances. 2778: Reclamation Wars begin. Later that year: Discovery of the artifact, causing AI corruption. Present: Earth and Mars coexist under constant threat from the Corrupt and potential alien forces."
        },
        {
            "id": 24,
            "title": "Main lore documented",
            "text": "Due to Earth numbers, Mars was forced to fight a defensive battle resulting in sustaining the most damage. Mars had hoped a show of aggression would deter the Earthen invasion to their planet but it was not the case, Earth's superior numbers meant it could withstand war for decades, something Mars' limited population could not. Mars all but lost the war until Dr. Fayol came up with the design for the EXO. The EXO was a martian built suit of armor powered by CORUM, several martian discoveries allowed for the creation of an extremely durable suit of armor. The strength of a tank but the agility of a human being pretty much single handedly turned the tide of all ground invasions. Also the fear of destroying precious CORUM deposits meant that most battles for these facilities had to be fought using ground and air combat and not bombings due to the volatility of CORUM.The EXO's proved so useful in combat that Earth was forced to pull out all soldiers from an unwinnable battle and seek a solution through diplomacy. Martians were so proud of their tech, that EXO's were renamed to knights and deemed the protectors of Mars. However, after the successful capture of an EXO by private military forces, the tech was eventually learned and redistributed. The most powerful nations of Earth all possessed knights and with it a new age of warfare was born, nations against nations, knights against knights. In 2778, CORUM and Mars was deemed a necessity for Earth's survival - acknowledging Mars as a separate and sovereign entity meant it could not alleviate Earth of its own survival needs and thus, Earth resumed its full scale assault of Mars. This time with its own army of EXO."
        },
        {
            "id": 25,
            "title": "Aris, a cyberneticist",
            "text": "Aris, a cyberneticist, fuses her mind with your EXO moments before being killed. The commander(user) is just a regular guy working at martian cybernetics lab that is secretly developing the a new type of exo. Aris is the reason we are alive and well. Aris in the end discovers that the UEA was never after the EXO, they wanted to take over Mars."
        },
        {
            "id": 26,
            "title": "All types of helmets",
            "text": "There is Crusader, drone, Knight, pilot, templar, catscan, broadcaster, warlord, skull knight, turking, blitzen, conductor, heartbreaker helmets for the EXO."
        }
    ]
}